Task-12A: Please provide two different dataframes of your own interest and then you are expected to merge them with respect to the following features:

Inner join,

Outer join,

Merge/on,

In [1]:
import pandas as pd
import numpy as np

In [24]:
 df1 = pd.DataFrame({'person': ['Cem', 'Can', 'Ali'],'department': ['Engineering', 'Marketing', 'Manager']})
 df2 = pd.DataFrame({'person': ['Can', 'Cem', 'Ömer'],'date': [2017,2018,2019]})
 display(df1, df2)

  person   department
0    Cem  Engineering
1    Can    Marketing
2    Ali      Manager

  person  date
0    Can  2017
1    Cem  2018
2   Ömer  2019

In [25]:
#inner join:
pd.merge(df1, df2, how='inner')

  person   department  date
0    Cem  Engineering  2018
1    Can    Marketing  2017

In [32]:
#outer join:
df4=pd.merge(df1, df2, how='outer')
df4

  person   department    date
0    Cem  Engineering  2018.0
1    Can    Marketing  2017.0
2    Ali      Manager     NaN
3   Ömer          NaN  2019.0

In [27]:
#merge
df3 = pd.merge(df1,df2)
df3

  person   department  date
0    Cem  Engineering  2018
1    Can    Marketing  2017

In [28]:
#merge on
display(df1, df2, pd.merge(df1, df2, on='person'))

  person   department
0    Cem  Engineering
1    Can    Marketing
2    Ali      Manager

  person  date
0    Can  2017
1    Cem  2018
2   Ömer  2019

  person   department  date
0    Cem  Engineering  2018
1    Can    Marketing  2017

TASK-12B: Please create a pivot table for titanic dataset with respect to the ports (S, C) and survived rate (as done in the example that we have covered). And then please add the sex/gender column to provide a better perspective to understand the data distribution.

In [47]:
import seaborn as sns
titanic = sns.load_dataset('titanic')

In [48]:
titanic.head()

   survived  pclass     sex   age  ...  deck  embark_town  alive  alone
0         0       3    male  22.0  ...   NaN  Southampton     no  False
1         1       1  female  38.0  ...     C    Cherbourg    yes  False
2         1       3  female  26.0  ...   NaN  Southampton    yes   True
3         1       1  female  35.0  ...     C  Southampton    yes  False
4         0       3    male  35.0  ...   NaN  Southampton     no   True

[5 rows x 15 columns]

In [56]:
titanic.pivot_table('survived', index='embarked', columns='sex')

sex         female      male
embarked
C         0.876712  0.305263
Q         0.750000  0.073171
S         0.689655  0.174603

TASK-12C: Please provide a time series by using pandas library to create an array containing the business days for the whole year (2021).

In [45]:
from pandas.tseries.offsets import BDay

In [46]:
pd.date_range('2021-01-01', '2021-12-31', freq=BDay())

DatetimeIndex(['2021-01-01', '2021-01-04', '2021-01-05', '2021-01-06',
               '2021-01-07', '2021-01-08', '2021-01-11', '2021-01-12',
               '2021-01-13', '2021-01-14',
               ...
               '2021-12-20', '2021-12-21', '2021-12-22', '2021-12-23',
               '2021-12-24', '2021-12-27', '2021-12-28', '2021-12-29',
               '2021-12-30', '2021-12-31'],
              dtype='datetime64[ns]', length=261, freq='B')